import unittest

from mikann import analyze_text, _cursor_word


class TestCursorWord(unittest.TestCase):
    def test_analyze_short_unit_words(self):
        # 测试不符合 UniDic 的「短単位」（Short Unit Word(s)）标准，但大多数辞书都有作为单独词条收录的测试用例
        test_cases = [
            (
                # 仮にそれが本当だとしたら  そもそも不倫じゃない==サイテー==
                # さいてい・最低
                # テレビアニメ「名探偵コナン」・1152話
                "サイテー",
                # 「サイテー」で「新明解国語辞典第八版」だけ検索できる
                [["サイテー", "最低"]],
            ),
            # 这部分记录那些在搜索建议中应该进一步优化的测试用例
            (
                # 実は学生が使ってる言語でも==ダントツ==の一位なのですほんとうは三冠なのですが、それは置いておいて、二冠二連覇の背景を説明します。
                # 断トツ
                # [人事部向けコラム「Pythonが二冠二連覇に（日経BP調査）」](https://www.pythonic-exam.com/archives/9291)
                "ダントツの一位なのです",
                [
                    # 新選国語辞典は「ダントツ」だけ検索できる
                    ["ダントツ", "断トツ"],
                    ["の", "の"],
                    ["一", "1"],
                    ["位", "位"],
                    ["な", "だ"],
                    ["の", "の"],
                    ["です", "です"],
                ],
            ),
            (
                # だいぶ==手こずってます==けど
                # 映画「君の名は。」
                # 手子摺る・手古摺る・てこずる
                "手こずってますけど",
                [
                    # 「現代新国語辞典」最好玩的就是这个只能「てこずる」
                    # 「新明解国語辞典第八版」の見出しの「漢字表記」がないが、「表記」の説明で「手子〈摺る・手古〈摺る・〈梃子〈摺る」と書いてある。
                    # 「大辞泉」用「手古摺る」搜不到
                    ["手こずっ", "手子摺る"],
                    ["て", "てる"],
                    ["ます", "ます"],
                    ["けど", "けれど"],
                ],
            ),
            (
                # （ＰＡ）文化祭のことを==憂い==ているんです
                # テレビアニメ「ぼっち・ざ・ろっく！」第10话
                "憂いているんです",
                [
                    # 从动词活用的规则来看，「憂う」应该才是正确答案
                    # 但不只「大辞泉」直接提示请参考「憂える」。
                    ["憂い", "憂える"],
                    ["て", "て"],
                    ["いる", "居る"],
                    ["ん", "の"],
                    ["です", "です"],
                ],
            ),
            # 这部分是 UniDic 未收录，而 Sudachi 已收录能正常解析
            (
                "初めまして",
                [
                    ["初めまして", "初めまして"],
                ],
            ),
            (
                # ７号室に首をつった人影が==ぼうっと==浮かび上がって　ゆらゆら揺れてたんだって
                # テレビアニメ「氷菓」第７話
                "人影がぼうっと浮かび上がって",
                [
                    ["人影", "人影"],
                    ["が", "が"],
                    ["ぼうっと", "ぼうっと"],
                    ["浮かび上がっ", "浮かび上がる"],
                    ["て", "て"],
                ],
            ),
            (
                # ==抗がん剤==の副作用がわかる本、世界のエッセンシャルドラッグ、ようこそダウン症の赤ちゃん、ぼくの手，おちゃわんタイプや、龍平の現在
                # 抗癌剤・こうがんざい
                # <https://ja.wikipedia.org/wiki/%E4%B8%89%E7%9C%81%E5%A0%82>
                "抗がん剤の副作用がわかる本、",
                [
                    ["抗がん剤", "抗癌剤"],
                    ["の", "の"],
                    ["副作用", "副作用"],
                    ["が", "が"],
                    ["わかる", "分かる"],
                    ["本", "本"],
                    ["、", "、"],
                ],
            ),
            (
                # ほとんど==事後承諾==だったけどな
                "事後承諾だったけどな",
                [
                    ["事後承諾", "事後承諾"],
                    ["だっ", "だ"],
                    ["た", "た"],
                    ["けど", "けれど"],
                    ["な", "な"],
                ],
            ),
            (
                # なぜ こんな所で==痴話ゲンカ==を…
                # 痴話喧嘩・ちわげんか
                #  テレビアニメ「負けヒロインが多すぎる」第1話
                "なぜこんな所で痴話ゲンカを",
                [
                    ["なぜ", "何故"],
                    ["こんな", "こんな"],
                    ["所", "所"],
                    ["で", "で"],
                    # FIXME 痴話ゲンカ 未登录词
                    # UniDic 未登录
                    ["痴話ゲンカ", "痴話喧嘩"],
                    ["を", "を"],
                ],
            ),
            # 接下来是 SudachiDict 中也尚未登录的词条测试用例
            (
                # ==ウォークスルー==とは、会議室などで参加者が机上でシミュレーションする形で、欠陥を発見していくレビュー手法です。
                # 「ウォークスルー」
                # <https://service.shiftinc.jp/column/8215/>
                "ウォークスルーとは",
                [
                    # FIXME 「ウォークスルー」 未登录词、大辞林と大辞泉だけ
                    # 正确的解析结果：["ウォークスルー", "ウォークスルー"],
                    ["ウォーク", "ウォーク"],
                    ["スルー", "スルー"],
                    ["と", "と"],
                    ["は", "は"],
                ],
            ),
            (
                # 先輩の路上ライブ見て==ひと目ぼれ==したの
                # 一目惚れ・ひとめぼれ
                # テレビアニメ『ぼっち・ざ・ろっく！ 』第3话「馳せサンズ」
                "先輩の路上ライブ見てひと目ぼれしたの",
                [
                    ["先輩", "先輩"],
                    ["の", "の"],
                    ["路上", "路上"],
                    ["ライブ", "ライブ"],
                    ["見", "見る"],
                    ["て", "て"],
                    # FIXME ひと目ぼれ 未登录词
                    # 正确的解析结果：["ひと目ぼれ", "一目惚れ"],
                    ["ひと目", "一目"],
                    ["ぼれ", "惚れ"],
                    ["し", "為る"],
                    ["た", "た"],
                    ["の", "の"],
                ],
            ),
            (
                # ==晴れて==メンバーが勢ぞろいしたのでした
                # ぼっち・ざ・ろっく！ 第03话「馳せサンズ」
                "晴れてメンバーが勢ぞろいしたのでした",
                [
                    # FIXME 晴れて 未登录词
                    # 正确的解析结果：["晴れて", "晴れる"],
                    ["晴れ", "晴れる"],
                    ["て", "て"],
                    ["メンバー", "メンバー"],
                    ["が", "が"],
                    ["勢ぞろい", "勢揃い"],
                    ["し", "為る"],
                    ["た", "た"],
                    ["の", "の"],
                    ["でし", "です"],
                    ["た", "た"],
                ],
            ),
            (
                # 会えない日が続くと　胸が==グッと==重くなったりしないか？
                # ヴァイオレット・エヴァーガーデン
                # 关于这个测试用例，可以参考正常测试用例的「人影が==ぼうっと==浮かび上がって」
                "胸がグッと重くなったりしないか",
                [
                    ["胸", "胸"],
                    ["が", "が"],
                    # FIXME グッと 未登录词
                    # 正确的解析结果：["グッと", "ぐっと"],
                    ["グッ", "ぐっ"],
                    ["と", "と"],
                    ["重く", "重い"],
                    ["なっ", "成る"],
                    ["たり", "たり"],
                    ["し", "為る"],
                    ["ない", "ない"],
                    ["か", "か"],
                ],
            ),
        ]
        for test_text, expected_output in test_cases:
            with self.subTest(cursor_index=test_text, expected_output=expected_output):
                self.assertEqual(analyze_text(test_text), expected_output)

    def test_cursor_word(self):
        # 0晩1ご2飯3を4食5べ6ま7し8た9か10。11
        test_cases = [
            # (光标索引, 期望的输出)
            # 光标在"晩御飯"之前
            (0, "晩御飯"),
            (1, "晩御飯"),
            (2, "晩御飯"),
            (3, "晩御飯"),
            (4, "を"),
            (5, "食べる"),
            (6, "食べる"),
            (7, "ます"),
            (8, "ます"),
            (9, "た"),
            (10, "か"),
            (11, "。"),
            # 异常测试
            # FIXME (12,  "。"),
            # FIXME  (1111,  "。"),
        ]
        for cursor_index, expected_output in test_cases:
            with self.subTest(
                cursor_index=cursor_index, expected_output=expected_output
            ):
                result = analyze_text("晩ご飯を食べましたか。")
                if cursor_index > sum(len(key) for key in result):
                    # 如果光标位置超出范围，检查是否抛出异常
                    with self.assertRaises(ValueError):
                        _cursor_word(result, cursor_index)
                else:
                    self.assertEqual(
                        _cursor_word(result, cursor_index), expected_output
                    )


if __name__ == "__main__":
    unittest.main()
